### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:590183702222:certificate/c2c503c5-9014-4c90-97cb-1a2ce7005f2c" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "*.designmanual.test.vylabs.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "designmanual.test.vylabs.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "test.design.vy.no"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:590183702222:certificate/c2c503c5-9014-4c90-97cb-1a2ce7005f2c" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-11-15T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-10-17T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "test.design.vy.no",
            # (2 unchanged elements hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate_validation.cloudfront must be replaced
-/+ resource "aws_acm_certificate_validation" "cloudfront" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:590183702222:certificate/c2c503c5-9014-4c90-97cb-1a2ce7005f2c" -> (known after apply) # forces replacement
      ~ id                      = "2025-10-17 09:03:11.987 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                         = [
          + "test.design.vy.no",
            # (2 unchanged elements hidden)
        ]
        id                              = "E2X66A4CTR5YKV"
        tags                            = {}
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:590183702222:certificate/c2c503c5-9014-4c90-97cb-1a2ce7005f2c" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["*.designmanual.test.vylabs.io"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply)
      ~ id                               = "Z040766361YOSZ9Z30XK__4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["designmanual.test.vylabs.io"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply)
      ~ id                               = "Z040766361YOSZ9Z30XK__4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["test.design.vy.no"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z040766361YOSZ9Z30XK"
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cloudfront_alias["test.design.vy.no"] will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "test.design.vy.no"
      + type            = "A"
      + zone_id         = "Z040766361YOSZ9Z30XK"

      + alias {
          + evaluate_target_health = false
          + name                   = "d3mi77z9vg0s3t.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.replacement["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "replacement" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:590183702222:listener-rule/app/common-services-alb-alb/8c4d830e0ee5ee4c/4279f655928097f6/9524bcfc71084308"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.test.vylabs.io",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "designmanual.test.vylabs.io",
                  + "test.design.vy.no",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.service["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "service" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:590183702222:listener-rule/app/common-services-alb-alb/8c4d830e0ee5ee4c/318925ed5ef56e93/4899b7391d8fd55f"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.test.vylabs.io",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "designmanual.test.vylabs.io",
                  + "test.design.vy.no",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 3 to change, 4 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 625951d69633d27d99d0c3ca5032363948d4c292*
*Plan generated at: 2025-10-20 14:17:01 UTC*
